tests/load-testing/results/ab_test_20250723_153826.txt
==========================================
Apache Bench Load Test Results
==========================================
------------------------------------------
Test with 10 concurrent users:
------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache/2.2.34
Server Hostname:        localhost
Server Port:            8888

Document Path:          /tag-you-write-repo/tag-you-write/
Document Length:        9461 bytes

Concurrency Level:      10
Time taken for tests:   9.006 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10121000 bytes
HTML transferred:       9461000 bytes
Requests per second:    111.04 [#/sec] (mean)
Time per request:       90.057 [ms] (mean)
Time per request:       9.006 [ms] (mean, across all concurrent requests)
Transfer rate:          1097.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:    48   89  21.6     86     211
Waiting:       47   88  21.4     85     211
Total:         48   89  21.6     86     211

Percentage of the requests served within a certain time (ms)
  50%     86
  66%     95
  75%    100
  80%    104
  90%    117
  95%    125
  98%    143
  99%    158
 100%    211 (longest request)
------------------------------------------
Test with 25 concurrent users:
------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache/2.2.34
Server Hostname:        localhost
Server Port:            8888

Document Path:          /tag-you-write-repo/tag-you-write/
Document Length:        9461 bytes

Concurrency Level:      25
Time taken for tests:   10.115 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10121000 bytes
HTML transferred:       9461000 bytes
Requests per second:    98.86 [#/sec] (mean)
Time per request:       252.883 [ms] (mean)
Time per request:       10.115 [ms] (mean, across all concurrent requests)
Transfer rate:          977.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    74  250  72.5    237     711
Waiting:       74  247  72.0    234     710
Total:         75  250  72.5    237     711

Percentage of the requests served within a certain time (ms)
  50%    237
  66%    259
  75%    276
  80%    290
  90%    351
  95%    397
  98%    439
  99%    472
 100%    711 (longest request)
------------------------------------------
Test with 50 concurrent users:
------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache/2.2.34
Server Hostname:        localhost
Server Port:            8888

Document Path:          /tag-you-write-repo/tag-you-write/
Document Length:        9461 bytes

Concurrency Level:      50
Time taken for tests:   9.411 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10121000 bytes
HTML transferred:       9461000 bytes
Requests per second:    106.26 [#/sec] (mean)
Time per request:       470.527 [ms] (mean)
Time per request:       9.411 [ms] (mean, across all concurrent requests)
Transfer rate:          1050.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:   102  461  89.8    457     717
Waiting:      100  456  88.7    452     717
Total:        102  461  89.7    457     717

Percentage of the requests served within a certain time (ms)
  50%    457
  66%    496
  75%    517
  80%    537
  90%    579
  95%    615
  98%    660
  99%    686
 100%    717 (longest request)
------------------------------------------
Test with 100 concurrent users:
------------------------------------------
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache/2.2.34
Server Hostname:        localhost
Server Port:            8888

Document Path:          /tag-you-write-repo/tag-you-write/
Document Length:        9461 bytes

Concurrency Level:      100
Time taken for tests:   9.869 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10121000 bytes
HTML transferred:       9461000 bytes
Requests per second:    101.32 [#/sec] (mean)
Time per request:       986.935 [ms] (mean)
Time per request:       9.869 [ms] (mean, across all concurrent requests)
Transfer rate:          1001.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       3
Processing:   101  962 237.1    967    2057
Waiting:       97  952 233.7    951    2002
Total:        101  962 236.9    967    2057

Percentage of the requests served within a certain time (ms)
  50%    967
  66%   1042
  75%   1100
  80%   1133
  90%   1227
  95%   1361
  98%   1529
  99%   1686
 100%   2057 (longest request)